content/posts/brodsky_dual_1999.md
+++
title = "brodsky_dual_1999 | Dual numbers representation of rigid body dynamics"
author = ["João Gutemberg Farias"]
draft = false
+++

## Info {#info}

A three-dimensional representation of rigid body dynamic equations becomes possible by introducing the dual inertia operator. This paper generalizes this result and by using motor transformation rules and the dual inertia operator, gives a general expression for the three-dimensional dynamic equation of a rigid body with respect to an arbitrary point.


## Notes {#notes}
